ST2CSE/08_CProgramming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ST2CSE</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="ST2CSE"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ST2CSE</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5da36a9">Commentaires</a></li>
<li><a href="#org06d9727">Instructions</a>
<ul>
<li><a href="#org5899279">Variables</a>
<ul>
<li><a href="#org1a312b1">Types</a></li>
<li><a href="#org7184027">Types énuméré</a></li>
</ul>
</li>
<li><a href="#org6f4e1d9">Opérations arithmétique</a></li>
</ul>
</li>
<li><a href="#org76e5c61">Structures de controle</a>
<ul>
<li><a href="#org5955f80">Conditions</a></li>
<li><a href="#org96caaa3">Boucles</a></li>
</ul>
</li>
<li><a href="#org5e3d426">Instructions pre-processeur</a>
<ul>
<li><a href="#orge848435">Inclure un fichier header</a></li>
<li><a href="#orga6c3b7e">Définir une</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-org5da36a9" class="outline-2">
<h2 id="org5da36a9">Commentaires</h2>
<div class="outline-text-2" id="text-org5da36a9">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Commentaires sur une ligne, peut s'ins&#233;rer apr&#232;s une instruction</span>

<span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">Bloc de commentaires </span>
<span style="font-weight: bold; font-style: italic;">multi-lignes</span>
<span style="font-weight: bold; font-style: italic;">*/</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org06d9727" class="outline-2">
<h2 id="org06d9727">Instructions</h2>
<div class="outline-text-2" id="text-org06d9727">
<p>
Une instruction en C se termine par un point virgule.
</p>
</div>

<div id="outline-container-org5899279" class="outline-3">
<h3 id="org5899279">Variables</h3>
<div class="outline-text-3" id="text-org5899279">
<p>
Les noms de variables utilisées en C doivent obligatoirement commencer 
par une lettre ou un underscore.
<b>Attention, ce langage est sensible à la casse!</b>.
</p>
</div>

<div id="outline-container-org1a312b1" class="outline-4">
<h4 id="org1a312b1">Types</h4>
<div class="outline-text-4" id="text-org1a312b1">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">ivar</span>=4;
<span style="font-weight: bold; text-decoration: underline;">float</span> <span style="font-weight: bold; font-style: italic;">fvar</span>=3.1415;
<span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">cvar</span>=<span style="font-style: italic;">'a'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7184027" class="outline-4">
<h4 id="org7184027">Types énuméré</h4>
<div class="outline-text-4" id="text-org7184027">
<p>
Ces types permettent à l'utilisateur de créer un type de variable et d'en définir les 
différents états. Nous nous en servirons pour les machines à états.
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">tricolore</span>{<span style="font-weight: bold; font-style: italic;">vert</span>, <span style="font-weight: bold; font-style: italic;">orange</span>, <span style="font-weight: bold; font-style: italic;">rouge</span>};
<span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">tricolore</span> <span style="font-weight: bold; font-style: italic;">feu</span>;
feu = orange; 
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org6f4e1d9" class="outline-3">
<h3 id="org6f4e1d9">Opérations arithmétique</h3>
<div class="outline-text-3" id="text-org6f4e1d9">
<p>
Les oprérations arithémtiques peuvent être réalisé entre des types différents, 
mais votre compilateur fera certainement un choix à votre place, et peut être pas celui que vous attendez&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">result</span>;
result = i+f;
result = i*f;
result = i/f;
result = i%f;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org76e5c61" class="outline-2">
<h2 id="org76e5c61">Structures de controle</h2>
<div class="outline-text-2" id="text-org76e5c61">
<p>
Les structures de contrôles  utilisent des conditions booléennes évalués entre parenthèses.
Si la condtion booléenne renvoit un résultat différent de 0, elle est considéré valide. Alors les instructions
placés entre accolades sont executés.
</p>
</div>

<div id="outline-container-org5955f80" class="outline-3">
<h3 id="org5955f80">Conditions</h3>
<div class="outline-text-3" id="text-org5955f80">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">if</span>(a==b){
}
<span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(a&lt;b){
}
<span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(a&gt;b){
}

</pre>
</div>

<p>
Une structure un peu particulière, et qui nous sera très utile pour faire une machine à état
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">switch</span> ( expression ) {
    <span style="font-weight: bold;">case</span> value1:
        statement;
        [<span style="font-weight: bold; text-decoration: underline;">statement</span>]...
        <span style="font-weight: bold;">break</span>;
    <span style="font-weight: bold;">case</span> value2:
        statement;
        [<span style="font-weight: bold; text-decoration: underline;">statement</span>]...
        <span style="font-weight: bold;">break</span>;
    <span style="font-weight: bold;">default</span>:
        statement;
        [<span style="font-weight: bold; text-decoration: underline;">statement</span>]...
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org96caaa3" class="outline-3">
<h3 id="org96caaa3">Boucles</h3>
<div class="outline-text-3" id="text-org96caaa3">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">for</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>=0;i&lt;10;i++){
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">while</span>(a&lt;b){
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5e3d426" class="outline-2">
<h2 id="org5e3d426">Instructions pre-processeur</h2>
<div class="outline-text-2" id="text-org5e3d426">
<p>
Ces instructions sont destinés aux pré-processeur, qui est une étape dans la compilation.
Le pre processeur est en charge vérifier la syntaxe et de créer un fichier avant la compilation à proporement parlé.
Ces instructions sont donc purement organisationnelles. 
</p>
</div>

<div id="outline-container-orge848435" class="outline-3">
<h3 id="orge848435">Inclure un fichier header</h3>
<div class="outline-text-3" id="text-orge848435">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">"definition.h"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6c3b7e" class="outline-3">
<h3 id="orga6c3b7e">Définir une</h3>
<div class="outline-text-3" id="text-orga6c3b7e">
<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">"definition.h"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
